<template>
  <section class="about" v-if="!pageLoading">
    <landing-page></landing-page>
    <div class="container my-2">
      <div class="about-campany">
        <h2>عن الشركة</h2>
        <p>
          هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
          النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من
          النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت
          تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد
          الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص
          العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من
          الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على 
        </p>
        <p>
          هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
          النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من
          النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت
          تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد
          الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص
          العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من
          الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم
        
        </p>
      </div>
      <!-- about-campany-->
      <div class="information_Founder my-3">
        <div class="d-flex justify-content-between content_founder">
          <div class="image col-lg-5 col-sm-12">
            <img
              src="@/assets/image/founder.png"
              alt=""
              width="100%"
              height="100%"
            />
          </div>
          <div class="content col-lg-6 col-sm-12">
            <h2>من هو مؤسس الشركة</h2>

            <p>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد
              هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
              العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
              التطبيق.
            </p>
            <p>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد
              هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
              العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
              التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
              العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي
              أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص،
              حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم
              الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التص
            </p>
            <p>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد
              هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو
              العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها
              التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص
              العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي
              أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص،
              حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم
              الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التص
            </p>
          </div>
        </div>
      </div>
      <!-- information_Founder -->
      <div class="about-content my-5">
        <p>
          ههذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
          النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من
          النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت
          تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد
          الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص
          العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من
          الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم
          أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص
          العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع
          الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
        </p>
      </div>
    </div>
    <!--  conatainer-->
  </section>
  <loaderPage v-if="pageLoading" />

</template>
<script>
import loaderPage from "@/components/layout/loaderPage.vue";

export default {
  components:{
    loaderPage,

  },
  data() {
    return {
      about: null,
    };
  },
  computed: {
    pageLoading() {
      return this.$store.getters["authModle/pageLoading"];
    },
  },
  mounted(){
    this.gethome()
  },
  methods: {
    gethome() {
      this.$store.commit("authModle/pageLoading", true);
      this.axios({
        method: "GET",
        url: "about",
      }).then((res) => {
        this.about = res.data.data;
        // this.$store.commit("authModle/pageLoading", false);
        setTimeout(() => {
        this.$store.commit("authModle/pageLoading", false);

        }, 600);
      });
    },
  
  },
};
</script>
<style lang="scss" scoped>
.about {
  text-align: justify;
  overflow: hidden;
  p{
    line-height: 38px;
    font-size: 18px;
  }
  h2 {
    text-align: center;
    padding: 20px 0;
    font-size: 25px;
  }
  .information_Founder {
    .content_founder {
      flex-wrap: wrap;
      gap: 10px;
    }
    .content {
      h2 {
        text-align: justify;
      }
    }
  }
}
// responsive
@media (max-width: 769px ) {
 p {
    font-size: 13px;
    line-height: 30px;
  }
  h2{
    font-size: 20px !important;
   

  }
}
@media (min-width: 769px) and (max-width: 1024px) {
 p {
    font-size: 15px;
    line-height: 35px;
  }
  h2{
    font-size: 25px !important;
   

  }
}
</style>